{
  "basics": {
    "label": "Senior Software Engineer",
    "email": "m.rebel@gmx.net",
    "phone": "0162 1042333",
    "name": "Matthias Rebel",
    "summary": "I'm a passionate software developer who pairs deep technical expertise with a wide strategic lens. My background in computational linguistics lets me weave human-language technologies, machine learning, and AI into products that engage users and unlock new value. I'm currently diving into multi-agent systems—exploring how autonomous agents can cooperate to solve problems.\n\nWhether I'm building large-scale NLP pipelines or refining user flows, I keep one eye on the technical detail and the other on the bigger business goal. I thrive on continuous improvement: digging into complex topics, sharing what I learn, and iterating quickly through agile practices and automation. That mix of specialization and generalist mindset helps me deliver high-impact, real-world solutions on fast timelines.\n\nI approach every project with curiosity, empathy, and a bias for action—aligning smart technology choices with clear business outcomes.",
    "profiles": [
      {
        "network": "GitHub",
        "username": "rebeling",
        "url": "https://github.com/rebeling"
      },
      {
        "network": "LinkedIn",
        "username": "matthias-rebel-525b3333",
        "url": "https://www.linkedin.com/in/matthias-rebel-525b3333/"
      }
    ]
  },
  "work": [
    {
      "position": "Senior Software Engineer",
      "startDate": "2018-10",
      "summary": "Led full-stack development and AI integration for a range of mission-critical projects, aligning deep technical implementation with strategic business goals. Spearheaded initiatives in automation, NLP, and secure systems design—contributing to product innovation, user engagement, and operational efficiency across the organization.",
      "highlights": [
        "Designed and implemented an AI-powered tool integrating chatbot capabilities with automated email responses, leveraging the company's knowledge base and ChatGPT (Docker, Python, FastAPI, OpenAI, Redis, JavaScript, Vue.js, GitLab CI).",
        "Engineered APIs for Belenios secure cryptographic online voting system integration, supporting 60,000 users and processing 600 votes per 30 seconds (Python, FastAPI).",
        "Built and maintained a scalable content pool aggregating news and events data for seamless mobile app integration (Python, Elasticsearch).",
        "Developed a custom Drupal module with AI-driven, NLP-enhanced search functionality (PHP, Python, Watson, spaCy, Elasticsearch).",
        "Optimized team Git workflows and CI/CD pipelines, significantly reducing deployment time and boosting collaboration efficiency (Git, GitLab, Make, Ansible).",
        "Organized and hosted local Drupal Meetups, driving community engagement and knowledge sharing."
      ]
    },
    {
      "position": "Software Engineer",
      "startDate": "2011-12",
      "endDate": "2018-07",
      "summary": "Owned core architecture and development of real-time, high-performance systems in a fast-paced consulting and product delivery environment. Delivered robust microservices and data pipelines that enabled personalization, automation, and scalable deployment—earning top feedback in [performance review](/data/rtr.pdf).",
      "highlights": [
        "Developed a real-time stream processing pipeline and personalization algorithm for adaptive content delivery (Python, Flask, Kafka, Elasticsearch).",
        "Provided technical consultancy to enterprise clients, guiding architecture decisions and best practices across projects.",
        "Led refactoring of legacy monoliths into containerized microservices, introducing CI/CD automation and scalable infrastructure.",
        "Designed and implemented a web-based GUI for a Translation Management System with seamless frontend-backend integration (AngularJS, Tornado, Elasticsearch).",
        "Developed a relation extraction system for short message analysis, enabling efficient insights from unstructured text data."
      ]
    },
    {
      "position": "Student Researcher",
      "startDate": "2009-05",
      "endDate": "2011-04",
      "summary": "As a Student Researcher at DFKI GmbH in Berlin (2009–2011), contributed to the development of a multilingual mobile dialogue assistant. Designed a classification algorithm to detect question–answer pairs and improved dialogue structures for a diploma thesis project. Positive feedback in [performance review](/data/dfki.pdf).",
      "highlights": [
        "Developed multilingual mobile dialogue assistant (PHP, Objective‑C).",
        "Designed classification algorithm for question‑answer pair detection.",
        "Enhanced user interaction and dialogue structures for diploma thesis project."
      ]
    },
    {
      "position": "Student Researcher",
      "startDate": "2006-03",
      "endDate": "2009-02",
      "highlights": [
        "Converted Word documents to XML for eXist‑db (Python, Tomcat).",
        "Developed data retrieval interface for project website (Python).",
        "Built CMS for personal staff websites (Python)."
      ]
    },
    {
      "position": "Media Educator",
      "startDate": "2003-09",
      "endDate": "2005-07",
      "highlights": [
        "Conducted lectures on computer interaction for children.",
        "Delivered training in Photoshop and digital drawing for trainees."
      ]
    }
  ],
  "education": [
    {
      "institution": "Universität Potsdam",
      "courses": [],
      "startDate": "2005-10",
      "endDate": "2011-10",
      "area": "Computational Linguistics",
      "studyType": "Diploma"
    },
    {
      "institution": "Wessenberg Gymnasium",
      "endDate": "1999-05",
      "area": "High School",
      "studyType": "Diploma"
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "level": "Expert",
      "keywords": [
        "Python",
        "PHP",
        "JavaScript"
      ]
    },
    {
      "name": "Backend Technologies",
      "level": "Senior",
      "keywords": [
        "Node.js",
        "PostgreSQL",
        "Redis",
        "Elasticsearch"
      ]
    },
    {
      "name": "DevOps & Infrastructure",
      "level": "Senior",
      "keywords": [
        "Docker",
        "AWS",
        "GitLab",
        "Jenkins",
        "Ansible",
        "Traefik"
      ]
    },
    {
      "name": "Frameworks & Tools",
      "keywords": [
        "FastAPI",
        "Drupal",
        "Make",
        "GitLab CI"
      ]
    },
    {
      "name": "Concepts & Architectures",
      "keywords": [
        "Serverless Architecture",
        "Microservices Architecture",
        "CI/CD Pipelines",
        "Containerization",
        "OpenAPI Specification"
      ]
    },
    {
      "name": "AI & Data Technologies",
      "keywords": [
        "Natural Language Processing",
        "Machine Learning",
        "MCP",
        "A2A"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "PyData Berlin 2016",
      "position": "Volunteer",
      "startDate": "2016-05-20",
      "endDate": "2016-05-21",
      "summary": "Supported event logistics and speaker coordination at PyData Berlin 2016, a community-driven conference focused on data science, machine learning, and Python. Helped ensure smooth operations for over 500 participants, gaining exposure to cutting-edge industry discussions and strengthening ties within the open-source Python and data science community."
    }
  ],
  "publications": [
    {
      "name": "Optimierung der Dialogstrukturen einer bilingualen elektronischen Kommunikationshilfe",
      "publisher": "Diploma thesis at Univertät Potsdam",
      "releaseDate": "2011-10-01"
    },
    {
      "name": "Computer Assistance in Bilingual Task-Oriented Human-Human Dialogues",
      "publisher": "In Proceedings of the 14th International Conference on Human-Computer Interaction",
      "releaseDate": "2011-07-09"
    }
  ],
  "interests": [
    {
      "name": "Sustainable Living",
      "keywords": [
        "Aquaponics",
        "Permaculture"
      ]
    },
    {
      "name": "Wildlife & Nature",
      "keywords": [
        "Tracking",
        "Forest Ecology"
      ]
    }
  ],
  "references": 0,
  "languages": [
    {
      "language": "German",
      "fluency": "Native Speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    }
  ]
}